# Primitive Data Type
# Number , Boolean , String

# Non-Primitive Data Type / Collection Data Structure ข้อมูลชนิดพื้นฐาน
# List , Tuple , Set , Dictionary

#Data Type จะเอามาใช้กับการเขียนโปรแกรมในเรื่องของ ตัวแปร พารามิเตอร์ ฟังก์ชั่น เมธอด

#-------------------- List ------------------
       # 0  1  2   3   4      5
list = [10,20,True,10,'KFC',[20,'COLA']]
       # -6 -5 -4  -3  -2      -1   ติดลบ
#-------------------- Tuple คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันได้ และมีลำดับ แต่แก้ไขไม่ได้ ----------------
       # 0  1  2   3   4      5
tuple = [10,20,True,10,'KFC',[20,'COLA']]
       # -6 -5 -4  -3  -2      -1   ติดลบ
#-------------------- Set คือ ข้อมูลหลายข้อมูล คนละชนิด ซ้ำกันไม่ได้(ถ้าซ้ำกันถือว่าเป็นตัวเดียว) และไม่มีลำดับ และแก้ไขไม่ได้ ----------------
set = {10,20,True,10,'KFC',[20,'COLA']}
# ******************* Dictionary คือ ข้อมูลหลายข้อมูล ที่เป็น key:value แก้ไขได้ ไม่มีลำดับ ซ้ำได้ ***************
# key เป็น string/integer ส่วน Value เป็นอิหยังก็ได้
Dictionary = {'name':'mod','age':30,555:999,'flag':True, 'wow':[10,20,30]}